team/case5/pisoInOut/0/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    wall
    {
        type            slip;
    }
    
    inlet1
    {
        type          	uniformFixedValue;
        uniformValue    table
        (
	  (0 (1 0 0))
	  (.3 (1 0 0))
	  (.5 (.5 0 0))
	  (.501 (1 0 0))
	);
    }
    inlet2
    {
        type            uniformFixedValue;
        uniformValue	table
        (
	  (0 (0 0 0))
	  (.2 (0 0 0))
	  (0.201 (0 -2.5 0))
	  (0.6 (0 -2.5 0))
	  (0.601 (0 0 0))
	);
    }
    outlet1
    {
        type            zeroGradient;
    }
    outlet2
    {
        type            inletOutlet;
	inletValue	uniform (0 0 0);
    }
    
}

// ************************************************************************* //
