team/case5/pisoInOut/0/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 0.005;

boundaryField
{
    wall
    {
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        type            epsilonWallFunction;
        value           uniform 0.005;
    }
    inlet1
    {
        type            fixedValue;
        value           uniform 0.005;
    }
    inlet2
    {
        type            fixedValue;
        value           uniform 0.005;
    }
    outlet1
    {
        type            zeroGradient;
    }
    outlet2
    {
        type            inletOutlet;
        inletValue      uniform 0;
        //value           uniform 0;
    }
}


// ************************************************************************* //
